// 题目描述
// 小明在越南旅游，参加了当地的娱乐活动。小明运气很好，拿到了大奖， 到了最后的拿奖金环节。小明发现桌子上放着一列红包，
// 每个红包上写着奖金数额。现在主持人给要求小明在这一列红包之间“切”2刀，将这一列红包“切”成3组，并且第一组的奖金之和
// 等于最后一组奖金和（允许任意一组的红包集合是空）。最终第一组红包的奖金之和就是小明能拿到的总奖金。小明想知道最多
// 能拿到的奖金是多少，你能帮他算算吗。

// 举例解释：桌子上放了红包  1, 2, 3, 4, 7, 10。小明在“4,7”之间、“7,10” 之间各切一刀，
// 将红包分成3组 [1, 2, 3, 4]   [7]   [10]，其中第一组奖金之和=第三组奖金之和=10，
// 所以小明可以拿到10越南盾。

// 输入
// 5
// 1 3 2 1 4
// 输出
// 4

// 输入
// 3
// 4 1 2
// 输出
// 0

#include <stdio.h>

int main ()
{
    int n, i;
    int t1_next, t2_next;
    long s[200000];
    long t1 = 0;
    long t2 = 0;
    long max = 0;

    scanf("%d", &n);
    for (i = 0; i < n; i++) {
        scanf("%ld", &s[i]);
    }

    t1_next = 0;
    t2_next = n - 1;
    t1 += s[t1_next++];
    t2 += s[t2_next--];
    for (i = 0; i < n; i++) {
        if (t1 < t2) {
            t1 += s[t1_next++];
        } else if (t1 > t2) {
            t2 += s[t2_next--];
        }
        if (t1 == t2) {
            max = t1;
            // 一端继续向前，找寻更大的可能
            t1 += s[t1_next++];
        }

        // 下标相差1时可以结束战斗
        if ((t1_next - 1) >= (t2_next)) {
            break;
        }
    }

    printf("%ld", max);

    return 0;
}